package stacksimple;

/**
 * Create a Stack based on a singly linked list
 * Создать Stack на базе односвязного списка
 *
 * 4. Используя контейнер на базе связанного
 * списка создать контейнер Stack [#293762]
 */

/**
 * Примечание по классу ForwardLinked
 * Базовая версия взята linkedforward\ForwardLinked.java
 * и добавлен метод deleteLast()
 */

/**
 * Stack - примитивная структура данных.
 * Работу этой структуры можно представить
 * в виде тарелок поставленных друг на другая.
 * Новая тарелка всего оказывается верхней.
 * Если нам нужно достать тарелку из середины стопки,
 * то нужно снять верхние тарелки.
 *
 * Stack лучше всего реализовать на базе связанного списка
 */
