package filters;

/**
 * Using filters
 * Фильтры [#293746] [#1732]
 *
 * В системе заданы таблицы
 *
 * product(id, name, type_id, expired_date, price)
 *
 * type(id, name)
 *
 * Задание.
 *
 * 1. Написать запрос получение всех продуктов с типом "СЫР"
 *
 * 2. Написать запрос получения всех продуктов, у кого в имени есть слово "мороженное"
 *
 * 3. Написать запрос, который выводит все продукты, срок годности которых заканчивается в следующем месяце.
 *
 * 4. Написать запрос, который выводит самый дорогой продукт.
 *
 * 5. Написать запрос, который выводит количество всех продуктов определенного типа.
 *
 * 6. Написать запрос получение всех продуктов с типом "СЫР" и "МОЛОКО"
 *
 * 7. Написать запрос, который выводит тип продуктов, которых осталось меньше 10 штук.
 *
 * 8. Вывести все продукты и их тип.
 *
 *
 *
 */
