package consolechat;

/**
 * Console Сhat
 * Консольный чат
 *
 * В рамках темы 6. Кодировка. [#862]
 *
 *  1. В этом задании необходимо создать программу 'Консольный чат'.
 *  Некоторое описание:
 *
 * - пользователь вводит слово-фразу, программа берет
 * случайную фразу из текстового файла и выводит в ответ.
 *
 * - программа замолкает если пользователь вводит слово «стоп»,
 * при этом он может продолжать  отправлять сообщения в чат.
 *
 * если пользователь вводит слово «продолжить», программа
 * снова начинает отвечать.
 *
 * - при вводе слова «закончить» программа прекращает работу.
 * - запись диалога, включая слова-команды  стоп/продолжить/закончить,
 * должны быть записаны в текстовый лог.(файл?)
 *
 */

