package setsimple;

/**
 * Implement a Set collection on an array
 * 1. Реализовать коллекцию Set на массиве [#293783]
 *
 * Коллекция должна обеспечивать void add(E e)
 * и реализовывать Iterable<E>.
 * Коллекция не должна хранить дубликаты.
 * Set - внутри для хранения данных должна использовать
 * обычные массивы.
 *
 * Код будет идентичным, как и в SimpleArray
 * (Это код из задания реализации списка на массиве).
 * как можно за счет композиции сократить
 * количества кода?
 * Здесь нужно использовать SimpleArray
 * в реализации SimpleSet.
 */
