package menua;

/*
1. Создать меню. [#4748]
в рамках темы ISP

Задание
Реализовать структуру для поддержания меню.
Каждый элемент меню имеет имя. Все меню должно выводиться на экран.
Каждый пункт меню может быть как одиночным элементом,
так и иметь дочерние подпункты.
Все меню должно выводиться на экран. В виде дерева.
Предусмотреть возможность определять действие,
когда пользователь выбирает конкретный пункт меню.
Например

Задача 1.
---- Задача 1.1.
--------- Задача 1.1.1.
--------- Задача 1.1.2.
----- Задача 1.2.
 */