package filescan;

/**
 *
 * Использование интерфейса FileVisitor
 *
 * 4.1. Сканирование файловой системы. [#293808]
 * Файловая система представляет собой древовидную структуру.
 * Есть алгоритмы, которые позволяет пройти по всем элементам
 * дерева.
 *
 * В Java есть встроенный механизм - FileVisitor.
 * java.nio.file.FileVisitor;
 *
 */

/**
 *
 * 5. Валидация параметров запуска. [#293810]
 * Валидация - это процесс проверки данных перед
 * выполнением операции.
 *
 * Добавляем сюда поиск с проверкой параметров
 *
 *
 */

/**
 * SearchArgs
 * Задание:
 * Программа должна запускаться с параметрами.
 * Первый параметр - начальная папка.
 * Второй параметр - расширение файлов, которые нужно искать.
 *
 * Отредактировать аргументы программы можно здесь:
 * Run -> Edit Сonfigurations (Сonfiguration -> Program arguments)
 */


