package fileinputstream;

/**
 *
 * 0.2. FileInputStream [#293819]
 * В этом уроке мы узнаем, как в Java прочитать файл.
 *
 * java.io.FileInputStream
 * Этот класс позволяет прочитать данные из файла.
 *
 * Создайте файл в корне проекта. Дайте ему имя input.txt.
 * Вставьте в него текст.
 *
 * login=login
 * password=password
 * url=url
 *
 * =====================
 *
 * Задание
 * 1. Создайте в корне проекта файл even.txt.
 * 2. В файл добавьте числа. Одно число  на строку.
 * -
 * 1
 * 5
 * 15
 * 17
 * 3
 * -
 * 3. Создайте класс EvenNumberFile с методом main.
 * 4. В классе нужно прочитать файл even.txt.
 * Для каждого числа проверить,
 * является ли оно четным числом.
 * Ответ вывести на консоль.
 *
 *
 *
 */
